{"Bomb party": {"commands": {"!bombparty": ["Starts a bomb party game with default difficulty. The difficulty can be changed using !difficulty"], "!join": ["To join the bomb party game, a user should use !join."], "!leave": ["Leave the bomb party game. This also works in the middle of a bomb party game."], "!start": ["The host can use this to start the game. Otherwise it will automatically start after 2 minutes."], "!settings &lt;setting&gt; &lt;value&gt;": ["Change a setting before starting the game. Valid settings are difficulty, lives, timer, and minimum_time.", "\tdifficulty - Can be one of the following: easy, medium, hard, nightmare, impossible.", "\tlives - A number between 1 and 5 that represents the amount of lives you start with.", "\ttimer - The amount of time the timer starts with.", "\tminimum_time - The amount of time each players gets that doesn't subtract from the timer."], "!players": ["Sends a list of players in the current bomb party lobby."]}, "description": []}, "Anime Compare": {"commands": {"!ac": ["Start a game of anime compare. Multiple people can play a game at the same time (though it will get very dank fairly quickly). You will be given two anime. Type 1 to pick the first, and 2 to pick the second. You want to pick the anime that you think is ranked more popular according to MAL. The anime are picked at random from the top 1000 most popular according to MAL."], "!ac_lb": ["See a leaderboard of the highest score games."], "!average_ac": ["See an average of all your scores across all your games."], "!ac_top": ["See your top score of all time."]}, "description": []}, "Scrambles": {"commands": {"!scramble": ["Get a word that you must unscramble (type the word in the chat for your answer)"], "!hint": ["Get a hint for the word that you're unscrambling"], "!scramble_osu": ["Get a player name that you must unscramble"], "!hint_osu": ["Get a hint for the player name that you're unscrambling"], "!scramble_map": ["Get a map name that you must unscramble"], "!hint_map": ["Get a hint for the map name that you're unscrambling"], "!scramble_emote": ["Get a emote name that you must unscramble"], "!hint_emote": ["Get a hint for the emote name that you're unscrambling"], "!scramble_genshin": ["Get a random Genshin Impact item or character to unscramble"], "!hint_genshin": ["Get a hint for the item or character you're unscrambling"], "!scramble_anime": ["Get a random anime in the top 200 most popular according to MAL to unscramble. The anime names are English where applicable."], "!hint_anime": ["Get a hint for the anime name you're unscrambling."], "!scramble_al": ["Get a random Azur Lane ship name to unscramble."], "!hint_al": ["Get a hint for the Azur Lane ship name you're unscrambling."], "!scramble_multiplier": ["See the difficulty multipliers for each scramble."], "!scramble_calc": ["Bot explains how scramble payout is calculated."]}, "description": ["Each scramble gives you 120 seconds to answer it correctly and you get Becky Bucks based on the calculation described in !scramble_calc. All characters in the answer are scrambled including spaces."]}, "Genshin Impact pulls": {"commands": {"!pull": ["Make a genshin pull"], "!genshinpull": ["Same thing as !pull"], "!pity": ["See your pull pity"]}, "description": []}, "osu! commands": {"commands": {"!link &lt;username&gt;": ["Link your twitch account to an osu account. This is the osu user that will be used by default for the other osu commands which require a username."], "!rs [player name] [-m &lt;gamemode&gt;] [-b] [-i &lt;index&gt;]": ["Show your or a player's most recent play. -b specifies that you want the most recent score in your top 100."], "!c [player name]": ["Shows your or a player's scores on the last map."], "!osu [player name] [-m &lt;gamemode&gt;]": ["Show your or a player's profile."], "!osutop [playername] [-m &lt;gamemode&gt;] [-r] [-i &lt;index&gt;]": ["Show your or a player's top 5 plays. -r will get the 5 most recent top plays in your top 100."], "!s [mods]": ["Show the amount for an fc on the last map with the mod combination provided. Provides amounts for 100%, 99%, 98%, 97%, 96%, and 95%."], "!m": ["Sends a link to the last map."]}, "description": ["For any command that has a [-m <gamemode>] argument, that means you can specify a specific mode. Not specifying a mode means it will use the default. You can change the gamemode by specifying the gamemode argument. 0 = standard; 1 = taiko; 2 = catch; 3 = mania. [-i <index>] means you can specify an index. The default index is 1."]}, "Miscellaneous fun": {"commands": {"!guess &lt;number&gt;": ["Guess a number between 1-1000, you'll be given feedback on whether to guess higher or lower until you guess the number. The number is automatically reset after every time it is guessed."], "!font &lt;font_name&gt; &lt;text&gt;": ["Turn a string of text into a certain font. To see a list of fonts do !fonts."], "!fonts": ["Get a list of valid fonts."], "!trivia [category]": ["Get a random multiple choice question which you will receive Becky Bucks for answering correctly and lose Becky Bucks for answering incorrectly. Category is optional and is also required to be a number. To know what numbers refer to what categories, see !trivia_category"], "!trivia_category": ["Sends this link https://opentdb.com/api_config.php and tells how to see which category is which number."], "!slap &lt;user&gt;": ["Slap a user (has a 50% chance of failing)."], "!rps &lt;choice&gt;": ["Play rock paper scissors with the bot. Specify, rock, paper, or scissors or you can also use the first letter for short. You gain 10 Becky Bucks for winning and lose 10 Becky Bucks for losing."], "!funfact": ["Get a random fun fact generated from https://uselessfacts.jsph.pl/random.json?language=en"]}, "description": []}, "Becky Bucks": {"commands": {"!bal": ["Check your Becky Bucks balance."], "!leaderboard": ["Check the leaderboard for Becky Bucks."], "!ranking": ["See your rank in terms of Becky Bucks."], "!give &lt;user&gt; &lt;amount&gt;": ["Give Becky Bucks to another player."]}, "description": []}, "User times": {"commands": {"!linktz &lt;timezone&gt;": ["Link your twitch account to a timezone."], "!validtz": ["Gives a link to valid timezones."], "!utime [username]": ["Show the time for you or the user specified if they have a timezone linked."]}, "description": []}, "Other": {"commands": {"!sourcecode": ["Sends a link to the repository with the source code for the bot (https://github.com/Sheepposu/offlinechatbot)"], "!help": ["Sends a link to https://bit.ly/3P0N8aR"], "!sheepp_filter": ["Posts a link to a pastebin which has filters made for the bot."], "!toggle &lt;setting&gt; &lt;on/off&gt;": ["Toggle a setting on/off. Valid settings:", "\treceive - Enabled by default. Allows people to give you Becky Bucks.", "\tautoafk - Enabled by default. Your afk is automatically removed when you send a message in any chat the bot is running in, at least 1 minute after setting the afk. Note: does not work in a chats where the streamer is live if they've enabled the bot to not run while they're live."], "!afk &lt;message&gt;": ["Set an afk with a message. If someone pings you while you're afk, they'll be notified with the message given. Afk is automatically removed when you send a message while afk (if at least a minute has passed)."], "!rafk": ["remove your afk manually (used when you have autoafk setting disabled)"], "!oct": ["Sends a link to the Offline Chat Tournament discord."]}, "description": []}}