{"Scrambles": {"commands": {"!scramble": ["Get a word that you must unscramble (type the word in the chat for your answer)"], "!hint": ["Get a hint for the word that you're unscrambling"], "!scramble_osu": ["Get a player name that you must unscramble"], "!hint_osu": ["Get a hint for the player name that you're unscrambling"], "!scramble_map": ["Get a map name that you must unscramble"], "!hint_map": ["Get a hint for the map name that you're unscrambling"], "!scramble_emote": ["Get a emote name that you must unscramble"], "!hint_emote": ["Get a hint for the emote name that you're unscrambling"], "!scramble_genshin": ["Get a random Genshin Impact item or character to unscramble"], "!hint_genshin": ["Get a hint for the item or character you're unscrambling"], "!scramble_multiplier": ["See the difficulty multipliers for each scramble."], "!scramble_calc": ["Bot explains how scramble payout is calculated."]}, "description": ["Each scramble gives you 120 seconds to answer it correctly and you get Becky Bucks based on the calculation described in !scramble_calc. All characters in the answer are scrambled including spaces."]}, "Genshin Impact pulls": {"commands": {"!pull": ["Make a genshin pull"], "!genshinpull": ["Same thing as !pull"], "!pity": ["See your pull pity"]}, "description": []}, "Miscellaneous fun": {"commands": {"!guess &lt;number&gt;": ["Guess a number between 1-1000, you'll be given feedback on whether to guess higher or lower until you guess the number. The number is automatically reset after every time it is guessed."], "!font &lt;font_name&gt; &lt;text&gt;": ["Turn a string of text into a certain font. To see a list of fonts do !fonts."], "!fonts": ["Get a list of valid fonts."], "!trivia": ["Get a random multiple choice question which you will receive Becky Bucks for answering correctly and lose Becky Bucks for answering incorrectly."], "!slap &lt;user&gt;": ["Slap a user (has a 50% chance of failing)."], "!rps &lt;choice&gt;": ["Play rock paper scissors with the bot. Specify, rock, paper, or scissors or you can also use the first letter for short. You gain 10 Becky Bucks for winning and lose 10 Becky Bucks for losing."], "!cum_fact": ["Get a random cum fact."]}, "description": []}, "Becky Bucks": {"commands": {"!bal": ["Check your Becky Bucks balance."], "!leaderboard": ["Check the leaderboard for Becky Bucks."], "!ranking": ["See your rank in terms of Becky Bucks."], "!give &lt;user&gt; &lt;amount&gt;": ["Give Becky Bucks to another player."]}, "description": []}, "Other": {"commands": {"!sheepp_filter": ["Posts a link to a pastebin which has filters made for the bot."], "!toggle &lt;setting&gt; &lt;on/off&gt;": ["Toggle a setting on/off. Valid settings:", "\treceive - Allows people to give you Becky Bucks."], "!afk &lt;message&gt;": ["Set an afk with a message. If someone pings you while you're afk, they'll be notified with the message given. Afk is automatically removed when you send a message while afk (if at least a minute has passed)."]}, "description": []}}